Revit 2024 API
DisciplineTypeId.Infrastructure Property
 Infrastructure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static ForgeTypeId Infrastructure { get; }
Visual Basic
Public Shared ReadOnly Property Infrastructure As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Infrastructure {
	ForgeTypeId^ get ();
}
See Also
DisciplineTypeId Class
Autodesk.Revit.DB Namespace